app/controllers/notes_controller.rb

	def index
		@notes = Note.all.order("created_at DESC")
---
SELECT "notes".* FROM "notes"  ORDER BY created_at DESC

	def create
		@note = current_user.notes.build(note_params)

		if @note.save
---
INSERT INTO "notes" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Lind"], ["content", "Rina"], ["user_id", 1], ["created_at", "2015-04-22 06:28:07.611558"], ["updated_at", "2015-04-22 06:28:07.611558"]]

	def update
		if @note.update(note_params)
---
UPDATE "notes" SET "title" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "Aku g"], ["updated_at", "2015-04-22 03:08:03.784857"], ["id", 2]]

	def find_note
		@note = Note.find(params[:id])
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 2]]